In [7]:
#punto 1
import random

num = int(input('Digite un numero entero: ')) #limites del intervalo donde van a estar los numeros

lista = []
count = 0

while count < 20:   #este while genera una lista con 20 numeros aleatorios
    a = random.randint(-num,num)
    lista.append(a)
    count +=1
# print (sorted(lista))
band = False
while band == False: #este while ordena los numeros de la lista con el algoritmo bbuble sort
    band = True 
    for i in range(len(lista)-1): #este for compara cada uno de sus elementos con el siguiente
        if  lista[i] > lista[i+1]: 
            aux = lista[i]
            lista[i] = lista[i+1]
            lista[i+1] = aux
            band = False

print(lista)

Digite un numero entero: 500
[-467, -452, -341, -311, -186, -97, -75, 128, 196, 231, 235, 264, 284, 315, 328, 348, 383, 444, 477, 477]

In [8]:
#punto 2
from itertools import permutations
num = int(input('Digite un numero entero entre 1 y 9: '))
lista = []
count = 0
if 1 <= num < 9 :
    for i in range(num):
        lista.append(i+1)
else:
    print("ingrese un numero valido")        

permutaciones = list(permutations(lista)) 
print(permutaciones)
print("el cardinal del conjunto de permutaciones es n! por lo tanto la cantidad de permutaciones de este conjunto es:")
print(len(permutaciones))

Digite un numero entero entre 1 y 9: 3
[(1, 2, 3), (1, 3, 2), (2, 1, 3), (2, 3, 1), (3, 1, 2), (3, 2, 1)]
el cardinal del conjunto de permutaciones es n! por lo tanto la cantidad de permutaciones de este conjunto es:
6

In [9]:
#punto 3
import pandas as pd
datos = {'CC':[79,39,19],
           'Nombre':["Juan Perez","Gilma Perez","Roberto Lopez"],
           'Direccion1':["KR 5 CL 9","CL78 KR 7","CL 90 KR 17"],
           'Direccion2':["CL67 KR 43"," ","KR 21 CL 85"],
           'Cel':[123,848,798],
           'Cta1':["xyz","cvb","xgi"],
           'Sal1':["$ 12","$ 33","$14"],
           'Cta2':["abc"," ","qdm"],
           'Sal2':["$ 6"," ","$ 45"],
           'Cta3':[" "," ","uio"],
           'Sal3':[" "," ","$ 56"]}
datos = pd.DataFrame(datos, columns = ["CC",
                                           "Nombre",
                                           "Direccion1",
                                           "Direccion2",
                                           "Cel",
                                           "Cta1",
                                           "Sal1",
                                           "Cta2",
                                           "Sal2",
                                           "Cta3",
                                           "Sal3"] )
datos

   CC         Nombre   Direccion1   Direccion2  Cel  ...  Sal1 Cta2  Sal2 Cta3  Sal3
0  79     Juan Perez    KR 5 CL 9   CL67 KR 43  123  ...  $ 12  abc   $ 6
1  39    Gilma Perez    CL78 KR 7               848  ...  $ 33
2  19  Roberto Lopez  CL 90 KR 17  KR 21 CL 85  798  ...   $14  qdm  $ 45  uio  $ 56

[3 rows x 11 columns]